------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/doylewr/lpo_prac/lessons/s1-08-validation/validation.log
  log type:  text
 opened on:  21 Oct 2020, 11:20:03

. 
. // NAME: Data cleaning
. // FILE: validation.do
. // AUTH: Will Doyle
. // REVS: Benjamin Skinner
. // INIT: 22 October 2014
. // LAST: 21 October 2020
.      
. clear all                               // clear memory

. 
. 
. global ddir "../../data/"

. 
. /***
> Calculating estimates and comparing them with known results
> -----------------------------------------------------------
> 
> Today, we'll use the {c 96}plans{c 96} dataset. We're going to compare our results with 
> several tables published by NCES. Let's start with educational expectations of high scho
> ol sophomores. We start by survey setting the data:
> 
> 
> ***/
. 
. // load plans data
. use ${ddir}plans.dta

. 
. // set up data for survey commands 
. svyset psu [pw = bystuwt], str(strat_id) singleunit(scaled)

      pweight: bystuwt
          VCE: linearized
  Single unit: scaled
     Strata 1: strat_id
         SU 1: psu
        FPC 1: <zero>

. 
. /***
> 
> ### Account for missing data
> 
> The next step is to account for missing data properly:
> 
> ***/
. 
. // set up local to hold variables we wish to recode 
. local allvar bystexp bysex byrace byses1 f1psepln 

. 
. mvdecode `allvar', mv(-9/-2)
     bystexp: 924 missing values generated
       bysex: 819 missing values generated
      byrace: 924 missing values generated
      byses1: 924 missing values generated
    f1psepln: 1958 missing values generated

. 
. // Recoding
. 
. recode bystexp (-1=8 )
(bystexp: 1450 changes made)

. 
. // Variable and value labeling
. 
. label define expect 1 "Less than HS" /// 
>                                         2 "HS/GED" ///
>                                         3 "2 Yr" ///
>                                         4 "Attend 4" ///
>                                         5 "BA Degree" ///
>                                         6 "Master's" ///
>                                         7 "PhD" ///
>                                         8 "Don't Know'"

. 
. label values bystexp expect     

. 
. label define race 1 "American Indian/AK Native" ///
>                                   2 "Asian/PI" ///
>                                   3 "African American/Black" ///
>                                   4 "Hispanic No Race Specified" ///
>                                   5 "Hispanic, Race Specified" ///
>                                   6 "Multiracial, non Hispanic" ///
>                                   7 "White" 

. 
. label values byrace race        

.                           
. /***
> ### Get estimates
> 
> Next, we tabulate expectations for college and compare it to a known estimate.
> 
> 
> ***/
. 
. 
. // student expectations for education 
. tab bystexp

  how far in |
      school |
     student |
 thinks will |
get-composit |
           e |      Freq.     Percent        Cum.
-------------+-----------------------------------
Less than HS |        128        0.84        0.84
      HS/GED |        983        6.45        7.29
        2 Yr |        879        5.77       13.06
    Attend 4 |        561        3.68       16.74
   BA Degree |      5,416       35.55       52.29
    Master's |      3,153       20.69       72.99
         PhD |      2,666       17.50       90.48
 Don't Know' |      1,450        9.52      100.00
-------------+-----------------------------------
       Total |     15,236      100.00

. 
. svy: proportion bystexp
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     361        Number of obs   =     16,160
Number of PSUs   =     751        Population size =  3,408,319
                                  Design df       =        390

      _prop_1: bystexp = Less than HS
      _prop_2: bystexp = HS/GED
      _prop_3: bystexp = 2 Yr
      _prop_4: bystexp = Attend 4
      _prop_5: bystexp = BA Degree
      _prop_6: bystexp = Master's
      _prop_8: bystexp = Don't Know'

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
bystexp      |
     _prop_1 |   .0094831     .00098       .007738    .0116172
     _prop_2 |   .0724693   .0030538      .0666899    .0787074
     _prop_3 |   .0643949   .0028925      .0589365    .0703211
     _prop_4 |   .0389852   .0018459      .0355139    .0427808
     _prop_5 |   .3578959   .0046507      .3488048    .3670902
     _prop_6 |   .1971035    .004424      .1885502    .2059464
         PhD |   .1608805   .0039873      .1531947    .1688749
     _prop_8 |   .0987875   .0030196      .0930076    .1048851
--------------------------------------------------------------

. 
. /***
> 
> Once you create estimates from a command like {c 96}proportion{c 96} 
> you can save them for later, using the {c 96}estimates store{c 96} command.
> These can be replayed using {c 96}replay{c 96} and can be brough back into memory using 
> {c 96}restore{c 96} 
> 
> ***/
. // store estimates
. estimates store expect_tab

. 
. // show estimates
. estimates replay expect_tab

------------------------------------------------------------------------------------------
Model expect_tab
------------------------------------------------------------------------------------------

Survey: Proportion estimation

Number of strata =     361        Number of obs   =     16,160
Number of PSUs   =     751        Population size =  3,408,319
                                  Design df       =        390

      _prop_1: bystexp = Less than HS
      _prop_2: bystexp = HS/GED
      _prop_3: bystexp = 2 Yr
      _prop_4: bystexp = Attend 4
      _prop_5: bystexp = BA Degree
      _prop_6: bystexp = Master's
      _prop_8: bystexp = Don't Know'

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
bystexp      |
     _prop_1 |   .0094831     .00098       .007738    .0116172
     _prop_2 |   .0724693   .0030538      .0666899    .0787074
     _prop_3 |   .0643949   .0028925      .0589365    .0703211
     _prop_4 |   .0389852   .0018459      .0355139    .0427808
     _prop_5 |   .3578959   .0046507      .3488048    .3670902
     _prop_6 |   .1971035    .004424      .1885502    .2059464
         PhD |   .1608805   .0039873      .1531947    .1688749
     _prop_8 |   .0987875   .0030196      .0930076    .1048851
--------------------------------------------------------------

. 
. // put estimates back in memory
. estimates restore expect_tab
(results expect_tab are active now)

. 
. /*** 
> Estimates can be stored using a simplified approach, using
> `eststo` and then the name of the estimates to be stored. 
> ***/
. 
. //one line version
. 
. eststo expect_tab: svy: tabulate bystexp
(running tabulate on estimation sample)

Number of strata   =       361                  Number of obs     =     15,236
Number of PSUs     =       751                  Population size   =  3,408,319
                                                Design df         =        390

----------------------
how far   |
in school |
student   |
thinks    |
will      |
get-compo |
site      | proportion
----------+-----------
 Less tha |      .0095
   HS/GED |      .0725
     2 Yr |      .0644
 Attend 4 |       .039
 BA Degre |      .3579
 Master's |      .1971
      PhD |      .1609
 Don't Kn |      .0988
          | 
    Total |          1
----------------------
  Key:  proportion  =  cell proportion

. 
. /***
> 
> ### Nicer tables
> 
> We get output in the console, but let's use the {c 96}eststo{c 96} and {c 96}esttab{c 96
> } commands to store our estimates and produce nicer tables. Using {c 96}esttab{c 96} alo
> ne, we'll get a nicely formatted table in the console. By adding {c 96}... using <file>{
> c 96} we save an {c 96}.rtf{c 96} version of the same table. We can easily paste this ta
> ble in a paper. 
> ***/
. 
. // use estpost to output results in format that esttab likes
. estpost svy: tabulate bystexp
(running tabulate on estimation sample)

Number of strata   =       361                  Number of obs     =     15,236
Number of PSUs     =       751                  Population size   =  3,408,319
                                                Design df         =        390

----------------------
how far   |
in school |
student   |
thinks    |
will      |
get-compo |
site      | proportion
----------+-----------
 Less tha |      .0095
   HS/GED |      .0725
     2 Yr |      .0644
 Attend 4 |       .039
 BA Degre |      .3579
 Master's |      .1971
      PhD |      .1609
 Don't Kn |      .0988
          | 
    Total |          1
----------------------
  Key:  proportion  =  cell proportion

saved vectors:
             e(b) =  cell proportions
            e(se) =  standard errors of cell proportions
            e(lb) =  lower 95% confidence bounds for cell proportions
            e(ub) =  upper 95% confidence bounds for cell proportions
          e(deff) =  deff for variances of cell proportions
          e(deft) =  deft for variances of cell proportions
          e(cell) =  cell proportions
         e(count) =  weighted counts
           e(obs) =  number of observations

. 
. eststo expect_tab

. 
. // save as table using esttab
. esttab expect_tab using expect_tab.rtf, /// 
>                 b(3) /// /* 3 decimal points for estimates */
>                 se(4) /// /* 4 decima points for se's */
>                 nostar /// /* No sig tests */
>                 nomtitles /// No column titles
>                 nonumbers /// No column numbers
>                 replace /* replace if file exists */
(output written to expect_tab.rtf)

. 
. /***
> ### Validate with published data
> 
> Now that we have a clean table to look at, is this the same as [Table 2 on page 22 of th
> e report](http://nces.ed.gov/pubs2005/2005338.pdf#50)? Yes. Checking the standard errors
>  on page B-3 reveals that these were also correctly done. Now we need to check this for 
> all of the other variables in our dataset.
> 
> <br>
> 
> #### Not-so-quick Exercise
> 
> > I want you to replicate [Table 34 on page 128 of NCES 2005-338](http://nces.ed.gov/pub
> s2005/2005338.pdf#154). We'll split this up, but I want the class to come up with a sing
> le table that has exactly the same results as the NCES document.
> 
> <br><br>                          
> ***/
. 
. 
. // end file     
. log close
      name:  <unnamed>
       log:  /Users/doylewr/lpo_prac/lessons/s1-08-validation/validation.log
  log type:  text
 closed on:  21 Oct 2020, 11:20:03
------------------------------------------------------------------------------------------
